In [1]:
import numpy as np
import pandas as pd

## Handle Categorical Features

### Ordinal Encoding

In [2]:
import datetime

In [3]:
today_date=datetime.datetime.today()

In [4]:
today_date

datetime.datetime(2020, 9, 7, 11, 38, 20, 120286)

In [5]:
#helps in date add/subtraction
today_date-datetime.timedelta(1)

datetime.datetime(2020, 9, 6, 11, 38, 20, 120286)

In [6]:
#getting date for last 15 days 
days=[today_date - datetime.timedelta(x) for x in range(0,15)]

In [7]:
data=pd.DataFrame(days)

In [8]:
data.columns=['Day']

In [9]:
data.head()

                         Day
0 2020-09-07 11:38:20.120286
1 2020-09-06 11:38:20.120286
2 2020-09-05 11:38:20.120286
3 2020-09-04 11:38:20.120286
4 2020-09-03 11:38:20.120286

In [10]:
#accessing date, time, month, weekday from the datetime object in the dataset 
data['Day'].dt.day

0      7
1      6
2      5
3      4
4      3
5      2
6      1
7     31
8     30
9     29
10    28
11    27
12    26
13    25
14    24
Name: Day, dtype: int64

In [11]:
data['weekday']=data['Day'].dt.day_name()

In [12]:
data.head()

                         Day   weekday
0 2020-09-07 11:38:20.120286    Monday
1 2020-09-06 11:38:20.120286    Sunday
2 2020-09-05 11:38:20.120286  Saturday
3 2020-09-04 11:38:20.120286    Friday
4 2020-09-03 11:38:20.120286  Thursday

In [13]:
mydict = {
    'Monday':1,
    'Tuesday':2,
    'Wednesday':3,
    'Thursday':4,
    'Friday':5,
    'Saturday':6,
    'Sunday':7
}

In [14]:
mydict

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [15]:
data['weekday_ordinal'] =data['weekday'].map(mydict)

In [16]:
data.head()

                         Day   weekday  weekday_ordinal
0 2020-09-07 11:38:20.120286    Monday                1
1 2020-09-06 11:38:20.120286    Sunday                7
2 2020-09-05 11:38:20.120286  Saturday                6
3 2020-09-04 11:38:20.120286    Friday                5
4 2020-09-03 11:38:20.120286  Thursday                4

### Freq Encoding

In [17]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [19]:
train_set[1].value_counts()

 Private             22696
 Self-emp-not-inc     2541
 Local-gov            2093
 ?                    1836
 State-gov            1298
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
Name: 1, dtype: int64

In [20]:
columns =[1,3,5,6,7,8,9,13]

In [26]:
train_set=train_set[columns]

In [27]:
train_set.columns = ['Employment', 'Degree', 'Status', 'Desgn', 'Family Job', 'Race', 'Sex', 'Country']

In [28]:
train_set.head()

,Employment,Degree,Status,Desgn,Family Job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [37]:
for feature in train_set.columns:
    print(feature, ':', len(train_set[feature].unique()))

Employment : 9
Degree : 16
Status : 7
Desgn : 15
Family Job : 6
Race : 5
Sex : 2
Country : 42

In [45]:
#creating a dict with 'key' as country name and 'value' as value count of the country
country_map=train_set['Country'].value_counts().to_dict()

In [46]:
##Count/freq encoding means replacing the categorical value with its own value counts

In [47]:
train_set['Country']=train_set['Country'].map(country_map)

In [48]:
train_set.head()

,Employment,Degree,Status,Desgn,Family Job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

**Adv**: Easy to use --- **Disadv**: Issue will be when freq/value counts for 2 or more categories will be the same | Same wt will be provided to categories having the same number of freq, to resolve this, we have to update one of the values so that the freq changes

### Target Guided ordinal encoding

Ordering/Replacing the labels according to the target

In [51]:
df=pd.read_csv('train.csv', usecols=['Cabin','Survived'])

In [52]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [53]:
df['Cabin'].fillna('Missing', inplace=True)

In [55]:
df.head(10)

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing
5         0  Missing
6         0      E46
7         0  Missing
8         1  Missing
9         1  Missing

In [57]:
df['Block']=df['Cabin'].str[0]

In [58]:
df.head()

   Survived    Cabin Block
0         0  Missing     M
1         1      C85     C
2         1  Missing     M
3         1     C123     C
4         0  Missing     M

In [60]:
df['Block'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [66]:
df.groupby(['Block'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Block')

In [67]:
ord_labels = df.groupby(['Block'])['Survived'].mean().sort_values().index

In [70]:
ord_labels2 = {k:i for i,k in enumerate(ord_labels, 0) }
ord_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [73]:
df['Cabin_ord']=df['Block'].map(ord_labels2)

In [74]:
df.head()

   Survived    Cabin Block  Cabin_ord
0         0  Missing     M          1
1         1      C85     C          4
2         1  Missing     M          1
3         1     C123     C          4
4         0  Missing     M          1